hwinther/micropython/ports/esp32/boards/ESP32_MICROWSH_C6/mpconfigboard.h
// This configuration is for a generic ESP32C6 board with 4MiB (or more) of flash.

#define MICROPY_HW_BOARD_NAME               "ESP32C6 module"
#define MICROPY_HW_MCU_NAME                 "RISC-V32"
#define MICROPY_PY_NETWORK_HOSTNAME_DEFAULT "microwsh"

// Enable UART REPL for modules that have an external USB-UART and don't use native USB.
#define MICROPY_HW_ENABLE_UART_REPL         (1)
